results-petclinic-harness_2_0_0-native-run/result-2026-01-05-18:08:48/wrk2_results_20260105_180849.txt
Running 30s test @ http://petclinic:8006
  16 threads and 16 connections
  Thread calibration: mean lat.: 2.130ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.033ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.020ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.162ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.106ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.251ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.160ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.496ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.461ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.717ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.280ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.718ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.589ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.498ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.249ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.101ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.18ms    3.90ms  54.59ms   96.67%
    Req/Sec   198.45     60.98     1.00k    81.52%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.56ms
 75.000%    1.87ms
 90.000%    2.33ms
 99.000%   25.53ms
 99.900%   44.42ms
 99.990%   53.69ms
 99.999%   54.53ms
100.000%   54.62ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.633     0.000000            2         1.00
       1.040     0.100000         5995         1.11
       1.190     0.200000        12007         1.25
       1.322     0.300000        17992         1.43
       1.443     0.400000        23973         1.67
       1.563     0.500000        29959         2.00
       1.622     0.550000        32945         2.22
       1.680     0.600000        35916         2.50
       1.740     0.650000        38926         2.86
       1.799     0.700000        41940         3.33
       1.868     0.750000        44902         4.00
       1.908     0.775000        46385         4.44
       1.954     0.800000        47881         5.00
       2.010     0.825000        49371         5.71
       2.083     0.850000        50887         6.67
       2.187     0.875000        52370         8.00
       2.251     0.887500        53110         8.89
       2.333     0.900000        53870        10.00
       2.425     0.912500        54616        11.43
       2.535     0.925000        55355        13.33
       2.687     0.937500        56103        16.00
       2.803     0.943750        56480        17.78
       2.999     0.950000        56850        20.00
       3.705     0.956250        57224        22.86
       5.055     0.962500        57598        26.67
       6.539     0.968750        57972        32.00
       7.275     0.971875        58159        35.56
       8.167     0.975000        58348        40.00
       9.463     0.978125        58533        45.71
      11.007     0.981250        58722        53.33
      13.935     0.984375        58907        64.00
      17.199     0.985938        59001        71.11
      20.447     0.987500        59095        80.00
      23.919     0.989062        59188        91.43
      26.655     0.990625        59281       106.67
      29.871     0.992188        59375       128.00
      31.567     0.992969        59423       142.22
      33.119     0.993750        59469       160.00
      34.719     0.994531        59515       182.86
      36.063     0.995313        59562       213.33
      37.503     0.996094        59609       256.00
      38.399     0.996484        59634       284.44
      39.103     0.996875        59655       320.00
      39.839     0.997266        59679       365.71
      40.511     0.997656        59702       426.67
      41.631     0.998047        59727       512.00
      41.919     0.998242        59738       568.89
      42.623     0.998437        59749       640.00
      43.231     0.998633        59761       731.43
      43.839     0.998828        59772       853.33
      44.703     0.999023        59784      1024.00
      45.535     0.999121        59790      1137.78
      46.111     0.999219        59796      1280.00
      47.295     0.999316        59802      1462.86
      48.159     0.999414        59807      1706.67
      49.919     0.999512        59813      2048.00
      50.239     0.999561        59816      2275.56
      50.655     0.999609        59819      2560.00
      51.231     0.999658        59822      2925.71
      51.807     0.999707        59825      3413.33
      52.095     0.999756        59828      4096.00
      52.735     0.999780        59830      4551.11
      52.863     0.999805        59831      5120.00
      53.151     0.999829        59832      5851.43
      53.247     0.999854        59834      6826.67
      53.599     0.999878        59835      8192.00
      53.695     0.999890        59836      9102.22
      53.791     0.999902        59837     10240.00
      53.791     0.999915        59837     11702.86
      53.919     0.999927        59838     13653.33
      54.143     0.999939        59839     16384.00
      54.143     0.999945        59839     18204.44
      54.207     0.999951        59840     20480.00
      54.207     0.999957        59840     23405.71
      54.207     0.999963        59840     27306.67
      54.527     0.999969        59841     32768.00
      54.527     0.999973        59841     36408.89
      54.527     0.999976        59841     40960.00
      54.527     0.999979        59841     46811.43
      54.527     0.999982        59841     54613.33
      54.623     0.999985        59842     65536.00
      54.623     1.000000        59842          inf
#[Mean    =        2.179, StdDeviation   =        3.897]
#[Max     =       54.592, Total count    =        59842]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  89874 requests in 29.87s, 12.09MB read
Requests/sec:   3008.47
Transfer/sec:    414.45KB

--- RESPONSE STATUS HISTOGRAM ---
Total requests: 0
Total errors (4xx/5xx): 0

Status code distribution:

Histogram data written to: /wrktemp/results/response_histogram.json